# print("Hello World!")

# однорядковий коментар

'''
три одинарні лапки
багаторядковий
коментар
тут можна писати будь-який текст і він буде проігнорований інтерпретатором
'''

# Ctrl + / -> comment или uncomment

# print("hello11")
# print("hello22")
#
# aljfjklsdfjkvskjfd
# print("qwerty")

###
# print("Hello world!")
# print()
# print('test')

###
# escape послідовності
# \n -> перенесення на новий рядок
# print("Hello\nworld")
# \t -> табуляція -> 4 пробіли. (буває в консолі 2 або 8 пробіли)
# print("Hello\n\tworld")
# \ -> дзеркалювання, екранування – якщо необхідно службовий символ зробити друкованим
# print("Hello\\n\\t \"world\"")
# print("\\\\\\\\\\")
###

# print("Hello world", "Text1", "Text2", sep=", ", end="-")
# print("Hello world")
# print('test')

# Книги:
#
# 1. Марк Лутц «Вивчаємо Python»
#
# 2. Ерік Метіз «Вивчаємо Python. Програмування ігор, візуалізація даних, веб-застосунки»
#
# 3. Пол Беррі "Вивчаємо програмування на Python"
#
# 4. Ел Свейгарт «Автоматизація рутинних завдань за допомогою Python. Практичний посібник для початківців»
#
# 5. Майкл Доусон "Програмуємо на Python"
#
# 6. Девід Бізлі, Браян К. Джонс «Python. Книга рецептів"
#
# Знайти можна у будь-якому зручному форматі.

# print("Hello World!")
